bit_and = 5 & 6
bit_or = 5 | 6
bit_xor = 5 ^ 6
bit_left = 5 << 2
bit_right = 5 >> 2

print(f'Выполним логические побитовые операции над числами 5 и 6:\n'
      f'5 = {bin(5)}\n'
      f'6 = {bin(6)}\n'
      f'5 & 6 = {bin(bit_and)} or {bit_and}\n'
      f'5 | 6 = {bin(bit_or)} or {bit_or}\n'
      f'5 ^ 6 = {bin(bit_xor)} or {bit_or}\n'
      f'Сдвиг влево на два = {bin(bit_left)} or {bit_left}\n'
      f'Сдвиг вправо на два = {bin(bit_right)} or {bit_right}')

# Объяснение: побитовый сдвиг вправо для положительных чисел равносилен целочисленному делению на 2 в степени n,
# где n - величина сдвига. Побитовый сдвиг влево равносилен умножению на 2 в степени n.
